# Plotting data

In [60]:
import pandas as pd
global_confirmed = pd.read_csv("Data/time_series_covid19_confirmed_global.csv")
global_deaths = pd.read_csv("Data/time_series_covid19_deaths_global.csv")
global_recovered = pd.read_csv("Data/time_series_covid19_recovered_global.csv")
global_confirmed.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/24/20,3/25/20,3/26/20,3/27/20,3/28/20,3/29/20,3/30/20,3/31/20,4/1/20,4/2/20
0,NaN,Afghanistan,33.0000,65.0000,0,0,0,0,0,0,...,74,84,94,110,110,120,170,174,237,273
1,NaN,Albania,41.1533,20.1683,0,0,0,0,0,0,...,123,146,174,186,197,212,223,243,259,277
2,NaN,Algeria,28.0339,1.6596,0,0,0,0,0,0,...,264,302,367,409,454,511,584,716,847,986
3,NaN,Andorra,42.5063,1.5218,0,0,0,0,0,0,...,164,188,224,267,308,334,370,376,390,428
4,NaN,Angola,-11.2027,17.8739,0,0,0,0,0,0,...,3,3,4,4,5,7,7,7,8,8

In [61]:
# Filter data
global_confirmed =  global_confirmed.drop(columns=["Long", "Lat", "Province/State"])
global_deaths =  global_deaths.drop(columns=["Long", "Lat", "Province/State"])
global_recovered =  global_recovered.drop(columns=["Long", "Lat", "Province/State"])
global_confirmed.head()

,Country/Region,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,1/30/20,...,3/24/20,3/25/20,3/26/20,3/27/20,3/28/20,3/29/20,3/30/20,3/31/20,4/1/20,4/2/20
0,Afghanistan,0,0,0,0,0,0,0,0,0,...,74,84,94,110,110,120,170,174,237,273
1,Albania,0,0,0,0,0,0,0,0,0,...,123,146,174,186,197,212,223,243,259,277
2,Algeria,0,0,0,0,0,0,0,0,0,...,264,302,367,409,454,511,584,716,847,986
3,Andorra,0,0,0,0,0,0,0,0,0,...,164,188,224,267,308,334,370,376,390,428
4,Angola,0,0,0,0,0,0,0,0,0,...,3,3,4,4,5,7,7,7,8,8

## Peru

In [71]:
# Select only Peru
peru_confirmed = global_confirmed.loc[global_confirmed['Country/Region'] == 'Peru']
peru_deaths = global_deaths.loc[global_deaths['Country/Region'] == 'Peru']
peru_recovered = global_recovered.loc[global_recovered['Country/Region'] == 'Peru']

### Confirmed

In [81]:
peru_confirmed = peru_confirmed.rename(index={181:'confirmed'})
peru_confirmed.head()

,Pais,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,1/30/20,...,3/24/20,3/25/20,3/26/20,3/27/20,3/28/20,3/29/20,3/30/20,3/31/20,4/1/20,4/2/20
confirmed,Peru,0,0,0,0,0,0,0,0,0,...,416,480,580,635,671,852,950,1065,1323,1414

### Deaths

In [84]:
peru_deaths = peru_deaths.rename(index={181:'deaths'})
peru_deaths.head()

,Country/Region,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,1/30/20,...,3/24/20,3/25/20,3/26/20,3/27/20,3/28/20,3/29/20,3/30/20,3/31/20,4/1/20,4/2/20
deaths,Peru,0,0,0,0,0,0,0,0,0,...,7,9,9,11,16,18,24,30,38,55

### Recovered

In [82]:
peru_recovered = peru_recovered.rename(index={178:'recovered'})
peru_recovered.head()

,Country/Region,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,1/30/20,...,3/24/20,3/25/20,3/26/20,3/27/20,3/28/20,3/29/20,3/30/20,3/31/20,4/1/20,4/2/20
recovered,Peru,0,0,0,0,0,0,0,0,0,...,1,1,14,16,16,16,53,394,394,537

### Join Peru's data

In [87]:
peru_data = pd.concat([peru_confirmed, peru_deaths, peru_recovered]).T
peru_data = peru_data.drop(index="Pais")
peru_data.head()

        confirmed deaths recovered
1/22/20         0      0         0
1/23/20         0      0         0
1/24/20         0      0         0
1/25/20         0      0         0
1/26/20         0      0         0